Revit 2024 API
DocumentEntryPoint.PlanTopologies Property
Gets the PlanTopologies of the current project.
Overload List
Name | Description
PlanTopologies
Get the PlanTopologies of the current project in the last phase.
 (Inherited from Document.)
PlanTopologies[Phase]
Gets the PlanTopologies of the current project in a given phase.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace